//
// 复杂声明
//
/**
 * 规则：
 * 1.数组名后面的[]和函数名后面的()具有相同的优先级.他们比*的优先级高;
 * 2.[]和()的优先级相同.
 * 3.[]和()都是从左往右结合
 * */

#include "stdio.h"

int main() {
    int a = 89;
    int *p = &a;
    int **ptr = &(p); //指向指针的指针，被指向的指针指向int
    printf("*ptr: %p, **ptr: %d\n", *ptr, **ptr);
    ///////////////////////////////////////////////////////////////////////
    int numbers[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
    // 声明一个内含10个元素的数组，每个元素都是一个指向int的指针
    int *risks[10];
    for (int i = 0; i < 10; i++) {
        risks[i] = &numbers[i];
    }
    for (int i = 0; i < 10; i++) {
        printf("address of risks[%d]: %p, Value: %d\n", i, risks[i], i, *risks[i]);
    }

    /////////////////////////////////////////////////////////////////////
    int array[10];
    int (*rusks)[10]; // 指向包含 10 个整数元素的数组的指针
    rusks = &array; // 指针指向数组

    // 通过指针访问数组元素
    (*rusks)[0] = 5;
    *(*rusks + 1) = 6; //rusks是一个指向包含 10 个整数元素的数组的指针,如果*(rusks + 1) = 6, 意味着指针移动了一整个数组的大小
    (*rusks)[2] = 10;

    // 输出数组元素
    printf("%d\n", (*rusks)[0]);
    printf("%d\n", *(*rusks + 1));
    printf("%d\n", (*rusks)[2]);
    ///////////////////////////////////////////////////////////////////
    int arr1[4] = {1, 2, 3, 4};
    int arr2[4] = {5, 6, 7, 8};
    int arr3[4] = {9, 10, 11, 12};
    //包含 3 个元素的数组 uof，每个元素都是一个指向包含 4 个整数元素的数组的指针。
    int (*uof[3])[4] = {&arr1, &arr2, &arr3};

    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 4; j++) {
            printf("%d ", (*uof[i])[j]);
        }
        printf("\n");
    }
    return 0;
}